ГТС/УТГТС/InformationRegisters/ГрафикПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГрафикПлатежей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбластиПланированияПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъектаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальностиГрафика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектОплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлательщикПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСуммГрафикаКредитовИДепозитов</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПереводовДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоступлениеСписание</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/Enums/СтатусыЗаявокНаРасходованиеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаРасходованиеДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/СтатусыЗаявокСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокСотрудников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозвана</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ФормыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ФормыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Взаимозачет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусныеБаллы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/СпособыПланированияОплатыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыПланированияОплатыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВВалютеПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВВалютеВзаиморасчетов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДвиженияДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Catalogs/Кассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Кассы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КассоваяКнига</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассовыеКниги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПлатежиБезУказанияЗаявок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИнкассации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКассаОбособленногоПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперационнаяКасса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКассирОбработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиПлатежейПриПеремещенииДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолучательПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/Catalogs/СтатьиДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтатьиДвиженияДенежныхСредств</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КорреспондирующийСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитываетсяВНалоговойБазеАУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ХозяйственныеОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ХозяйственнаяОперация</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/CommonModules/ДенежныеСредстваВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Формирует структуру для создания оплаты по нескольким заявкам на расходование средств
// Если в переданных заявках отличаются ключевые реквизиты шапки, выдается сообщение об ошибке.
//
// Параметры:
//    МассивСсылок   - Массив - заявки на расходование средств, по которым необходимо ввести оплату
//    ФормаОплаты - Строка - форма оплаты заявки
//    РаспределениеОплаты - Массив - строки остатков распределения оплаты.
//
// Возвращаемое значение:
//    Булево - Ложь, если в переданных заказах отличаются реквизиты шапки.
//
Функция СформироватьДанныеЗаполненияОплаты(МассивСсылок, ФормаОплаты, РаспределениеОплаты) Экспорт
	
	ТекстЗапроса =
		ТекстЗапросаПроверкаСтатуса() +
		ТекстЗапросаРаспределениеОплаты();
	
	Если МассивСсылок.Количество() > 1 Тогда
		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаВозможностьГруппировкиЗаявок();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Если ФормаОплаты = "Безналичная" Тогда
		Запрос.УстановитьПараметр("ТипМестаОплаты", Тип("СправочникСсылка.БанковскиеСчетаОрганизаций"));
	ИначеЕсли ФормаОплаты = "Наличная" Тогда
		Запрос.УстановитьПараметр("ТипМестаОплаты", Тип("СправочникСсылка.Кассы"));
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	Отказ = Ложь;
	Если Не РезультатЗапроса[0].Пустой() > 0 Тогда
						
		СоответствиеДопустимыхСтатусовЗаявок = СоответствиеДопустимыхСтатусовЗаявок();
		ДопустимыеСтатусыПоУмолчанию = СоответствиеДопустимыхСтатусовЗаявок.Получить(Тип("ПеречислениеСсылка.СтатусыЗаявокНаРасходованиеДенежныхСредств"));
		
		ВыборкаЗаявки = РезультатЗапроса[0].Выбрать();
		Пока ВыборкаЗаявки.Следующий() Цикл
			
			ДопустимыеСтатусы = СоответствиеДопустимыхСтатусовЗаявок.Получить(ТипЗНЧ(ВыборкаЗаявки.Статус));
			ДопустимыеСтатусы = ?(ДопустимыеСтатусы = Неопределено,	ДопустимыеСтатусыПоУмолчанию, ДопустимыеСтатусы);
			
			ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
				ВыборкаЗаявки.Заявка,
				ВыборкаЗаявки.Статус,
				ВыборкаЗаявки.ЕстьОшибкиПроведен,
				ВыборкаЗаявки.ЕстьОшибкиСтатус,
				ДопустимыеСтатусы);
		КонецЦикла;
		
	ИначеЕсли МассивСсылок.Количество() > 1 Тогда
		
		Выборка = РезультатЗапроса[2].Выбрать();
		Выборка.Следующий();
		Если СообщитьОбОшибкахФормированияДанныхЗаполненияОплаты(Выборка) Тогда
			
			ТекстОшибки = НСтр("ru='Ввод одного документа оплаты на основании выделенных заявок невозможен'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	РаспределениеОплаты = ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса[1].Выгрузить());
	
	Возврат Не Отказ;
	
КонецФункции

Функция СоответствиеДопустимыхСтатусовЗаявок()
	
	СоответствиеТиповСтатусов 		= Новый Соответствие;	
	
	ДопустимыеСтатусыПоУмолчанию 	= Новый Массив;
	ДопустимыеСтатусыПоУмолчанию.Добавить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);	
	
	ДопустимыеСтатусыЗаявокСотрудников 	= Новый Массив;
	ДопустимыеСтатусыЗаявокСотрудников.Добавить(Перечисления.СтатусыЗаявокСотрудников.Согласована);        
	
	СоответствиеТиповСтатусов.Вставить(Тип("ПеречислениеСсылка.СтатусыЗаявокСотрудников"),ДопустимыеСтатусыЗаявокСотрудников);
	СоответствиеТиповСтатусов.Вставить(Тип("ПеречислениеСсылка.СтатусыЗаявокНаРасходованиеДенежныхСредств"),ДопустимыеСтатусыПоУмолчанию);
		
	Возврат СоответствиеТиповСтатусов;
	
КонецФункции

// Преобразует двоичные данные файла в текст
//
// Параметры:
//    АдресФайла - Строка - Адрес временного хранилища с данными файла
//    Кодировка - Строка - "DOS" или "Windows".
//
// Возвращаемое значение:
//    ТекстовыйДокумент - Текст файла.
//
Функция ТекстовыйДокументИзВременногоХранилищаФайла(АдресФайла, Кодировка) Экспорт
	
	Если Кодировка = "UTF-8" Тогда
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ИначеЕсли Кодировка = "Windows" ИЛИ Кодировка = "DOS" Тогда
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");
	Иначе
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	КонецЕсли;
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайла); // ДвоичныеДанные
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
	Текст = Новый ТекстовыйДокумент();
	Если Кодировка = "DOS" Тогда
		Кодир = "cp866";
	ИначеЕсли Кодировка = "UTF-8" Тогда
		Кодир = "UTF-8";
	Иначе
		Кодир = "windows-1251";
	КонецЕсли;
	
	Текст.Прочитать(ИмяВременногоФайла, Кодир);
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		Событие = НСтр("ru = 'Загрузка банковской выписки'", ОбщегоНазначения.КодОсновногоЯзыка())
			+ "." + НСтр("ru = 'Удаление временного файла'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(Событие,
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат Текст;
	
КонецФункции

// Получает SWIFT банка
// 
// Параметры:
//  Банк - СправочникСсылка.КлассификаторБанков - ссылка на банк
// Возвращаемое значение:
//  Строка - SWIFT банка.
Функция SWIFT(Банк) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Банк, "СВИФТБИК")
	
КонецФункции


// Возвращает признак использования списка подотчетных лиц в документе "Заявка на расходование ДС"
// 
// Параметры:
//  ЗаявкиНаОплату - Массив из ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств - список документов "Заявка на расходование ДС"
// 
// Возвращаемое значение:
//  Булево
//
Функция СписокФизЛицПоЗаявкамНаОплату(ЗаявкиНаОплату) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ЗаявкаНаРасходованиеДенежныхСредств.СписокФизЛиц) КАК СписокФизЛиц
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
		|ГДЕ
		|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка В (&СписокДокументов)";
	
	Запрос.УстановитьПараметр("СписокДокументов", ЗаявкиНаОплату);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	Возврат ?(ЗначениеЗаполнено(РезультатЗапроса.СписокФизЛиц), РезультатЗапроса.СписокФизЛиц, Ложь);
	
КонецФункции

Функция Выполнить_ПроверкаКурсовЗачетаВАвансовыхОтчетах(Параметры) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, "ДенежныеСредстваСервер.Выполнить_ПроверкаКурсовЗачетаВАвансовыхОтчетах", Параметры);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПроверкаСтатуса()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Заявка.Ссылка КАК Заявка,
	|	Заявка.Статус КАК Статус,
	|	НЕ Заявка.Проведен КАК ЕстьОшибкиПроведен,
	|	ВЫБОР КОГДА НЕ (Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате))
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОшибкиСтатус
	|	
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка
	|ГДЕ
	|	Заявка.Ссылка В (&МассивСсылок)
	|	И (НЕ Заявка.Проведен ИЛИ
	|		Заявка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Заявка.Ссылка КАК Заявка,
	|	Заявка.Статус КАК Статус,
	|	НЕ Заявка.Проведен КАК ЕстьОшибкиПроведен,
	|	ВЫБОР КОГДА НЕ (Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокСотрудников.Согласована))
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОшибкиСтатус
	|	
	|ИЗ
	|	Документ.ЗаявкаНаКомандировку КАК Заявка
	|ГДЕ
	|	Заявка.Ссылка В (&МассивСсылок)
	|	И (НЕ Заявка.Проведен ИЛИ
	|		Заявка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокСотрудников.Согласована))
	|;
	|
	|///////////////////////////////////////////////////////
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВозможностьГруппировкиЗаявок()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ
	|			ВЫБОР КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|					ИЛИ Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|					ИЛИ Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.ПлатежнаяКарта)
	|				ТОГДА Заявка.ФормаОплатыЗаявки
	|			КОНЕЦ) > 1
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОтличияФормаОплаты,
	|	МИНИМУМ(ВЫБОР КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ИЛИ Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ИЛИ Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.ПлатежнаяКарта)
	|		ТОГДА Заявка.ФормаОплатыЗаявки
	|		КОНЕЦ) КАК ФормаОплатыЗаявки,
	|	
	|	МИНИМУМ(ВЫБОР КОГДА Заявка.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа)
	|			ТОГДА Заявка.Валюта
	|		КОГДА Заявка.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов)
	|			ТОГДА
	|				ВЫБОР КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|						И Заявка.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|					ТОГДА Заявка.Касса.ВалютаДенежныхСредств
	|					КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|						И Заявка.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|					ТОГДА Заявка.БанковскийСчет.ВалютаДенежныхСредств
	|				КОНЕЦ
	|		КОНЕЦ) КАК Валюта,
	|	МИНИМУМ(Заявка.Валюта) КАК ВалютаКандидат,
	|	ВЫБОР КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ
	|		ВЫБОР КОГДА Заявка.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа)
	|			ТОГДА Заявка.Валюта
	|		КОГДА Заявка.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов)
	|			ТОГДА 
	|				ВЫБОР КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|						И Заявка.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|					ТОГДА Заявка.Касса.ВалютаДенежныхСредств
	|					КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|						И Заявка.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|					ТОГДА Заявка.БанковскийСчет.ВалютаДенежныхСредств
	|				КОНЕЦ
	|		КОНЕЦ) > 1
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОтличияВалютаОплаты,
	|	
	|	МИНИМУМ(Заявка.Организация) КАК Организация,
	|	ВЫБОР КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Заявка.Организация) > 1
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОтличияОрганизация,
	|	
	|	МИНИМУМ(Заявка.ХозяйственнаяОперация) КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Заявка.ХозяйственнаяОперация) > 1
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОтличияХозяйственнаяОперация,
	|	
	|	МИНИМУМ(Заявка.ХозяйственнаяОперацияПоЗарплате) КАК ХозяйственнаяОперацияПоЗарплате,
	|	ВЫБОР КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Заявка.ХозяйственнаяОперацияПоЗарплате) > 1
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОтличияХозяйственнаяОперацияПоЗарплате,
	|	
	|	МИНИМУМ(Заявка.Контрагент) КАК Контрагент,
	|	ВЫБОР КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Заявка.Контрагент) > 1
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОтличияКонтрагент,
	|	
	|	МИНИМУМ(Заявка.ПодотчетноеЛицо) КАК ПодотчетноеЛицо,
	|	ВЫБОР КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Заявка.ПодотчетноеЛицо) > 1
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОтличияПодотчетноеЛицо,
	|	
	|	ВЫБОР КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ
	|		ВЫБОР КОГДА Заявка.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА Заявка.Касса
	|		КОНЕЦ) > 1
	|			ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОтличияКасса,
	|	МИНИМУМ(ВЫБОР КОГДА Заявка.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|		ТОГДА Заявка.Касса
	|	КОНЕЦ) КАК Касса,
	|	
	|	ВЫБОР КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ
	|		ВЫБОР КОГДА Заявка.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА Заявка.БанковскийСчет
	|		КОНЕЦ) > 1
	|			ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОтличияБанковскийСчет,
	|	МИНИМУМ(ВЫБОР КОГДА Заявка.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|		ТОГДА Заявка.БанковскийСчет
	|	КОНЕЦ) КАК БанковскийСчет,
	|	
	|	ВЫБОР КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Заявка.Подразделение) > 1 ТОГДА
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|		ИНАЧЕ МИНИМУМ(Заявка.Подразделение)
	|	КОНЕЦ КАК Подразделение,
	|	
	|	ВЫБОР КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Заявка.БанковскийСчетКонтрагента) > 1 ТОГДА
	|		ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка)
	|		ИНАЧЕ МИНИМУМ(Заявка.БанковскийСчетКонтрагента)
	|	КОНЕЦ КАК БанковскийСчетКонтрагента,
	|	
	|	ВЫБОР КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Заявка.СтатьяДвиженияДенежныхСредств) > 1 ТОГДА
	|		ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|		ИНАЧЕ МИНИМУМ(Заявка.СтатьяДвиженияДенежныхСредств)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	
	|	ВЫБОР КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Заявка.СтатьяАктивовПассивов) > 1 ТОГДА
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|		ИНАЧЕ МИНИМУМ(Заявка.СтатьяАктивовПассивов)
	|	КОНЕЦ КАК СтатьяАктивовПассивов,
	|	
	|	МИНИМУМ(ВЫБОР КОГДА Заявка.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств))
	|		ТОГДА Заявка.КассаПолучатель
	|		ИНАЧЕ Неопределено
	|	КОНЕЦ) КАК КассаПолучатель,
	|	МИНИМУМ(ВЫБОР КОГДА Заявка.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств))
	|		ТОГДА Заявка.БанковскийСчетПолучатель
	|		ИНАЧЕ Неопределено
	|	КОНЕЦ) КАК БанковскийСчетПолучатель,
	|	
	|	МИНИМУМ(Заявка.ВалютаКонвертации) КАК ВалютаКонвертации,
	|	МИНИМУМ(Заявка.КурсКонвертации) КАК КурсКонвертации,
	|	
	|	МИНИМУМ(ВЫБОР КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеВБюджет)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ) КАК ПеречислениеВБюджет,
	|	
	|	МИНИМУМ(Заявка.АналитикаАктивовПассивов) КАК АналитикаАктивовПассивов,
	|	
	|	МИНИМУМ(Заявка.Контрагент.Наименование) КАК КонтрагентНаименование,
	|	МИНИМУМ(Заявка.Контрагент.НаименованиеПолное) КАК КонтрагентНаименованиеПолное,
	|	МИНИМУМ(Заявка.ПодотчетноеЛицо.Наименование) КАК ПодотчетноеЛицоНаименование
	|	
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка
	|
	|ГДЕ
	|	Заявка.Ссылка В (&МассивСсылок)
	|;
	|
	|//////////////////////////////////////////////////
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРаспределениеОплаты()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ГрафикПлатежей.БанковскийСчетКасса,
	|	ГрафикПлатежей.ДатаПлатежа,
	|	СУММА(ГрафикПлатежей.Сумма) КАК Сумма
	|ИЗ
	|	РегистрСведений.ГрафикПлатежей КАК ГрафикПлатежей
	|ГДЕ
	|	ГрафикПлатежей.ОбъектОплаты В(&МассивСсылок)
	|	И ГрафикПлатежей.ПоступлениеСписание = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Списание)
	|СГРУППИРОВАТЬ ПО
	|	ГрафикПлатежей.БанковскийСчетКасса,
	|	ГрафикПлатежей.ДатаПлатежа
	|;
	|
	|///////////////////////////////////////////////////////
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция СообщитьОбОшибкахФормированияДанныхЗаполненияОплаты(ВыборкаРеквизитыШапки)
	
	Отказ = Ложь;
	
	ТекстСообщения = НСтр("ru='У выделенных заявок на расходование денежных средств отличается поле ""%ПредставлениеПоля%""'");
	
	Если ВыборкаРеквизитыШапки.ЕстьОтличияФормаОплаты Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрЗаменить(ТекстСообщения, "%ПредставлениеПоля%", НСтр("ru='Форма оплаты'")),,,, Отказ);
	КонецЕсли;
	
	Если ВыборкаРеквизитыШапки.ЕстьОтличияХозяйственнаяОперация Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрЗаменить(ТекстСообщения, "%ПредставлениеПоля%", НСтр("ru='Хозяйственная операция'")),,,, Отказ);
	КонецЕсли;
	
	Если ВыборкаРеквизитыШапки.ЕстьОтличияХозяйственнаяОперацияПоЗарплате Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрЗаменить(ТекстСообщения, "%ПредставлениеПоля%", НСтр("ru='Хозяйственная операция по зарплате'")),,,, Отказ);
	КонецЕсли;
	
	Если ВыборкаРеквизитыШапки.ЕстьОтличияВалютаОплаты Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрЗаменить(ТекстСообщения, "%ПредставлениеПоля%", НСтр("ru='Валюта'")),,,, Отказ);
	КонецЕсли;
	
	Если ВыборкаРеквизитыШапки.ЕстьОтличияОрганизация Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрЗаменить(ТекстСообщения, "%ПредставлениеПоля%", НСтр("ru='Организация'")),,,, Отказ);
	КонецЕсли;
	
	Если ВыборкаРеквизитыШапки.ЕстьОтличияКонтрагент Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрЗаменить(ТекстСообщения, "%ПредставлениеПоля%", НСтр("ru='Контрагент'")),,,, Отказ);
	КонецЕсли;
	
	Если ВыборкаРеквизитыШапки.ЕстьОтличияПодотчетноеЛицо Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрЗаменить(ТекстСообщения, "%ПредставлениеПоля%", НСтр("ru='Подотчетное лицо'")),,,, Отказ);
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

Функция ОплатитьСтрокиГрафика(СтрокиГрафика, ТипДокумента) Экспорт
	
	Возврат ДенежныеСредстваСервер.ОплатитьСтрокиГрафика(СтрокиГрафика, ТипДокумента);
	
КонецФункции

#КонецОбласти

#Область НалогообложениеНДС

// Устанавливает признак совпдадения обекта расчетов с документом в таблице и заполняет налогообложение строки
//
// Параметры:
// 	Параметры - Структура:
//		* Ссылка - ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств,
//			ДокументСсылка.ПриходныйКассовыйОрдер,
//			ДокументСсылка.РасходныйКассовыйОрдер,
//			ДокументСсылка.СписаниеБезналичныхДенежныхСредств,
//			ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств,
//			ДокументСсылка.ОперацияПоПлатежнойКарте - Ссылка на график исполнения.
//		* НалогообложениеНСДПоумолчанию - ПеречислениеСсылка.ТипыНалогообложенияНДС - Тип налогообложения, определенный для текущего документа;
//		* ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчтетов.
//
// Возвращаемое значение:
// 	Структура - Новые значения строки:
//		* СтавкаНДС - СправочникСсылка.СтавкиНДС - Ставка НДС по НалогообложениюНДС;
//		* НалогообложениеНДС - ПеречислениеСсылка.ТипыНалогообложенияНДС - Тип налогобложения для строки;
//		* ОбъектРасчетовСовпадаетСДокументом - Булево - Признак совпадения объекта расчетов с документом.
//
Функция ЗаполнитьРеквизитыДляНДСВСтроке(Параметры) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("НалогообложениеНДС", Неопределено);
	Результат.Вставить("ОбъектРасчетовСовпадаетСДокументом", Ложь);
	
	Если ЗначениеЗаполнено(Параметры.Договор) Тогда
		НалогообложениеПоДоговору = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Договор, "НалогообложениеНДС");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ОбъектРасчетов)
				И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ОбъектРасчетов, "Объект")= Параметры.Ссылка Тогда
				
			Результат.НалогообложениеНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ОбъектРасчетов, "НалогообложениеНДС");
			Если НЕ ЗначениеЗаполнено(Результат.НалогообложениеНДС) Тогда
				Результат.НалогообложениеНДС = НалогообложениеПоДоговору;
			КонецЕсли;
			Результат.ОбъектРасчетовСовпадаетСДокументом = Ложь;
			
	Иначе
			
			Результат.НалогообложениеНДС = Параметры.НалогообложениеНСДПоумолчанию;
			Результат.ОбъектРасчетовСовпадаетСДокументом = Истина;
				
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
